var ctx = document.getElementById('myChart0').getContext('2d');
var myChart = new Chart(ctx, {
    type: 'bar',
    data: {
        labels:['Mobile - разработчик 28184', 'Веб 152894', 'Программист 183633', 'Data Scientist 3848',
            'GameDev 7950', 'ERP 130938', 'Системный инженер (+QA-инженер) 53333', 'Администратор баз данных 6265',
            'Системный программист 3068', 'Системный администратор 136672', 'Devops 18414', 'UX/UI дизайнер 32604',
            'Менеджер (IT-проекта) 135785', 'Аналитик 71983', 'Специалист по интернет-маркетингу 125926',
            'Специалист техподдержки 55472', 'Инженер 45380', 'IT-специалист 14745', 'Специалист по информационной безопасности 8297',
            'Руководитель 24232', 'Мусор 145891'],
        datasets: [{
            label: 'value',
            data: [28184, 152894, 183633, 3848, 7950, 130938, 53333, 6265, 3068, 136672, 18414, 32604, 135785, 71983, 125926, 55472, 45380, 14745, 8297, 24232, 145891],
            backgroundColor:
                'rgba(216, 27, 96, 0.8)',
            borderColor:
                'rgba(216, 27, 96, 1)',
            borderWidth: 1
        }]
    },
    options: {
        responsive: false,
        legend: {
            display: false
        },
        title: {
            display: true,
            text: 'Общий график. Количество вакансий в группах',
            position: 'top',
            fontSize: 16,
            padding: 20
        },
        scales: {
            yAxes: [{
                ticks: {
                    min: 0
                }
            }]
        }
    }
});//Общий график. Количество вакансий в группах

var start = document.getElementById('myChart00').getContext('2d');
var myChart00 = new Chart(start, {
    type: 'bar',
    data: {
        labels: ['Mobile - разработчик 1976', 'Веб 3713', 'Программист 7815', 'Data Scientist 641', 'GameDev 673', 'ERP 6503', 'Системный инженер (+QA-инженер) 2911', 'Администратор баз данных 229', 'Системный программист 156', 'Системный администратор 6136', 'Devops 2113', 'UX/UI дизайнер 1303', 'Менеджер (IT-проекта) 6545', 'Аналитик 5441', 'Специалист по интернет-маркетингу 5633', 'Специалист техподдержки 3660', 'Инженер 2260', 'IT-специалист 604', 'Специалист по информационной безопасности 661', 'Руководитель 1127', 'Мусор 5602'],
        datasets: [{
            label: 'value',
            data: [1976, 3713, 7815, 641, 673, 6503, 2911, 229, 156, 6136, 2113, 1303, 6545, 5441, 5633, 3660, 2260, 604, 661, 1127, 5602],
            backgroundColor:
                'rgba(241, 58, 19, 0.8)',
            borderColor:
                'rgba(204, 6, 5, 1)',
            borderWidth: 1,
        }]
    },
    options: {
        responsive: false,
        legend: {
            display: false
        },
        title: {
            display: true,
            text: 'Общий график за 2021',
            position: 'top',
            fontSize: 16,
            padding: 20
        },
        scales: {
            yAxes: [{
                ticks: {
                    min: 0,
                },
            }]
        }
    }
}); //Общий график за 2021

var gr1 = document.getElementById('gr2020').getContext('2d');
var gr2020 = new Chart(gr1, {
    type: 'bar',
    data: {
        labels: ['Mobile - разработчик 4533', 'Веб 11066', 'Программист 19767', 'Data Scientist 1099', 'GameDev 1573', 'ERP 15810', 'Системный инженер (+QA-инженер) 7019', 'Администратор баз данных 572', 'Системный программист 377', 'Системный администратор 14559', 'Devops 4315', 'UX/UI дизайнер 2827', 'Менеджер (IT-проекта) 14902', 'Аналитик 11592', 'Специалист по интернет-маркетингу 13420', 'Специалист техподдержки 6771', 'Инженер 5711', 'IT-специалист 1591', 'Специалист по информационной безопасности 1644', 'Руководитель 2529', 'Мусор 16320'],
        datasets: [{
            label: 'value',
            data: [4533, 11066, 19767, 1099, 1573, 15810, 7019, 572, 377, 14559, 4315, 2827, 14902, 11592, 13420, 6771, 5711, 1591, 1644, 2529, 16320],
            backgroundColor:
                'rgba(347, 100, 56, 0.8)',
            borderColor:
                'rgba(123, 0, 28, 1)',
            borderWidth: 1,
        }]
    },
    options: {
        responsive: false,
        legend: {
            display: false
        },
        title: {
            display: true,
            text: 'Общий график за 2020',
            position: 'top',
            fontSize: 16,
            padding: 20
        },
        scales: {
            yAxes: [{
                ticks: {
                    min: 0,
                },
            }]
        }
    }
});//Общий график за 2020

var gr2 = document.getElementById('gr2019').getContext('2d');
var gr2019 = new Chart(gr2, {
    type: 'bar',
    data: {
        labels: ['Mobile - разработчик 4931', 'Веб 15463', 'Программист 23948', 'Data Scientist 1145', 'GameDev 1532', 'ERP 20193', 'Системный инженер (+QA-инженер) 7973', 'Администратор баз данных 627', 'Системный программист 343', 'Системный администратор 18080', 'Devops 4320', 'UX/UI дизайнер 3488', 'Менеджер (IT-проекта) 16752', 'Аналитик 11804', 'Специалист по интернет-маркетингу 15922', 'Специалист техподдержки 8549', 'Инженер 6842', 'IT-специалист 2216', 'Специалист по информационной безопасности 1527', 'Руководитель 2919', 'Мусор 17117'],
        datasets: [{
            label: 'value',
            data: [4931, 15463, 23948, 1145, 1532, 20193, 7973, 627, 343, 18080, 4320, 3488, 16752, 11804, 15922, 8549, 6842, 2216, 1527, 2919, 17117],
            backgroundColor:
                'rgba(180, 76, 67, 0.8)',
            borderColor:
                'rgba(175, 64, 53, 1)',
            borderWidth: 1,
        }]
    },
    options: {
        responsive: false,
        legend: {
            display: false
        },
        title: {
            display: true,
            text: 'Общий график за 2019',
            position: 'top',
            fontSize: 16,
            padding: 20
        },
        scales: {
            yAxes: [{
                ticks: {
                    min: 0,
                },
            }]
        }
    }
});//Общий график за 2019

var gr3 = document.getElementById('gr2018').getContext('2d');
var gr2018 = new Chart(gr3, {
    type: 'bar',
    data: {
        labels: ['Mobile - разработчик 4349', 'Веб 19372', 'Программист 24254', 'Data Scientist 842', 'GameDev 1256', 'ERP 19968', 'Системный инженер (+QA-инженер) 6961', 'Администратор баз данных 554', 'Системный программист 317', 'Системный администратор 17463', 'Devops 3113', 'UX/UI дизайнер 3973', 'Менеджер (IT-проекта) 17222', 'Аналитик 9833', 'Специалист по интернет-маркетингу 16673', 'Специалист техподдержки 7795', 'Инженер 6331', 'IT-специалист 2231', 'Специалист по информационной безопасности 1388', 'Руководитель 2870', 'Мусор 40659'],
        datasets: [{
            label: 'value',
            data: [4349, 19372, 24254, 842, 1256, 19968, 6961, 554, 317, 17463, 3113, 3973, 17222, 9833, 16673, 7795, 6331, 2231, 1388, 2870, 40659],
            backgroundColor:
                'rgba(27,85,131, 0.6)',
            borderColor:
                'rgba(26, 72, 118, 0.8)',
            borderWidth: 1,
        }]
    },
    options: {
        responsive: false,
        legend: {
            display: false
        },
        title: {
            display: true,
            text: 'Общий график за 2018',
            position: 'top',
            fontSize: 16,
            padding: 20
        },
        scales: {
            yAxes: [{
                ticks: {
                    min: 0,
                },
            }]
        }
    }
});//Общий график за 2018

var gr4 = document.getElementById('gr2017').getContext('2d');
var gr2017 = new Chart(gr4, {
    type: 'bar',
    data: {
        labels: ['Mobile - разработчик 3549', 'Веб 18279', 'Программист 19832', 'Data Scientist 422', 'GameDev 917', 'ERP 15777', 'Системный инженер (+QA-инженер) 5455', 'Администратор баз данных 482', 'Системный программист 256', 'Системный администратор 13747', 'Devops 1898', 'UX/UI дизайнер 3506', 'Менеджер (IT-проекта) 14233', 'Аналитик 7750', 'Специалист по интернет-маркетингу 14622', 'Специалист техподдержки 5789', 'Инженер 5085', 'IT-специалист 1530', 'Специалист по информационной безопасности 953', 'Руководитель 2435', 'Мусор 14127'],
        datasets: [{
            label: 'value',
            data: [3549, 18279, 19832, 422, 917, 15777, 5455, 482, 256, 13747, 1898, 3506, 14233, 7750, 14622, 5789, 5085, 1530, 953, 2435, 14127],
            backgroundColor:
                'rgba(188, 143, 143, 0.6)',
            borderColor:
                'rgba(204, 146, 147, 0.8)',
            borderWidth: 1,
        }]
    },
    options: {
        responsive: false,
        legend: {
            display: false
        },
        title: {
            display: true,
            text: 'Общий график за 2017',
            position: 'top',
            fontSize: 16,
            padding: 20
        },
        scales: {
            yAxes: [{
                ticks: {
                    min: 0,
                },
            }]
        }
    }
});//Общий график за 2017