data= [19338, 67893, 95616, 4149, 5951, 78251, 30319, 2464, 1449, 69985, 15759, 15097, 69654, 46420, 66270, 32564, 26229, 8172, 6173, 11880]

labels=['Mobile - разработчик 3549', 'Веб 18279', 'Программист 19832', 'Data Scientist 422', 'GameDev 917', 'ERP 15777', 'Системный инженер (+QA-инженер) 5455', 'Администратор баз данных 482', 'Системный программист 256', 'Системный администратор 13747', 'Devops 1898', 'UX/UI дизайнер 3506', 'Менеджер (IT-проекта) 14233', 'Аналитик 7750', 'Специалист по интернет-маркетингу 14622', 'Специалист техподдержки 5789', 'Инженер 5085', 'IT-специалист 1530', 'Специалист по информационной безопасности 953', 'Руководитель 2435']

f = []
result = {data[i] : labels[i] for i in range(len(data))}
k = sorted(result.keys(), reverse=True)

for i in k:
    h = result[i]
    f.append(h)

print(k)
print(f)
